/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_malloc.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mi <mi@student.42seoul.kr>                 +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/07/04 22:19:33 by mi                #+#    #+#             */
/*   Updated: 2023/07/04 22:21:15 by mi               ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void *ft_malloc(size_t size)	// 할당시 에러 처리한 malloc
{
	void *ptr;

	ptr = malloc(size);
	if (!ptr)
	{
		ft_error("malloc error", 1);
		exit(1);
	}
	return (ptr);
}